## Project #2: Working with Untidy Data


### Part 1: Student Test Performance Data

Here we have an untidy csv file that displays test performance for 5 students on 2 exams over 3 terms.

In [5]:
import pandas as pd

#read in untidy data csv as a pandas dataframe object
student_testing_df = pd.read_csv('/home/lv24252260/Documents/Project2/untidy_data_student_tests.csv')

#read first 5 rows to check that dataframe was created
student_testing_df.head()

   id    name  phone sex and age test number  term 1  term 2  term 3
0   1    Mike    134        m_12      test 1      76      84      87
1   2   Linda    270        f_13      test 1      88      90      79
2   3     Sam    210        m_11      test 1      78      74      80
3   4  Esther    617        f_12      test 1      68      75      74
4   5    Mary    114        f_14      test 1      65      67      64

We can see that there are several problems with this data. The data is not sorted in a way that makes sense. The students are repeated twice in the column (once for each test), the sex and age of the students is in a single column separated by and underscore instead of in two separate columns.

The best way to approach this is to split the data into two separate dataframe objects with pandas: one for the students, and one for the test data. We can use the ID number as the relational primary/foreign key.

In [7]:
#split the dataframe into two separate tables, one for students and one for the grades
students_df = student_testing_df[['id', 'name', 'phone', 'sex and age']].copy() # make a copy to avoid warning
test_grades_df = student_testing_df[['id', 'test number', 'term 1', 'term 2', 'term 3']]

# Split single column into two columns
students_df[['Sex', 'Age']] = students_df['sex and age'].str.split("_", expand=True)

# modify original dataframe using .loc accessor
students_df.loc[:, ['Sex', 'Age']] = students_df[['Sex', 'Age']]

# drop the original 'sex and age' column
students_df.drop('sex and age', axis=1, inplace=True)

#Check the dataframe
students_df.head()

   id    name  phone Sex Age
0   1    Mike    134   m  12
1   2   Linda    270   f  13
2   3     Sam    210   m  11
3   4  Esther    617   f  12
4   5    Mary    114   f  14

In [9]:
#Since the Test Grades dataframe isn't very large, we can print the whole thing to see the data
print(test_grades_df)

   id test number  term 1  term 2  term 3
0   1      test 1      76      84      87
1   2      test 1      88      90      79
2   3      test 1      78      74      80
3   4      test 1      68      75      74
4   5      test 1      65      67      64
5   1      test 2      85      80      90
6   2      test 2      87      82      94
7   3      test 2      80      87      80
8   4      test 2      70      75      78
9   5      test 2      68      70      63

The test grades dataframe is in a wide format. We can change it to a long format, which is more computer-friendly. We do this using the melt() function in pandas. The id and test number are kept as variables and the term columns are melted into a single column called "term." The corresponding test score values are also arranged into single column called "score."

In [10]:
tidy_grades_df = test_grades_df.melt(id_vars=['id', 'test number'], value_vars=['term 1', 'term 2', 'term 3'], var_name='term', value_name='score')

In [12]:
#now we have a long format dataframe for test grades:
print(tidy_grades_df)

    id test number    term  score
0    1      test 1  term 1     76
1    2      test 1  term 1     88
2    3      test 1  term 1     78
3    4      test 1  term 1     68
4    5      test 1  term 1     65
5    1      test 2  term 1     85
6    2      test 2  term 1     87
7    3      test 2  term 1     80
8    4      test 2  term 1     70
9    5      test 2  term 1     68
10   1      test 1  term 2     84
11   2      test 1  term 2     90
12   3      test 1  term 2     74
13   4      test 1  term 2     75
14   5      test 1  term 2     67
15   1      test 2  term 2     80
16   2      test 2  term 2     82
17   3      test 2  term 2     87
18   4      test 2  term 2     75
19   5      test 2  term 2     70
20   1      test 1  term 3     87
21   2      test 1  term 3     79
22   3      test 1  term 3     80
23   4      test 1  term 3     74
24   5      test 1  term 3     64
25   1      test 2  term 3     90
26   2      test 2  term 3     94
27   3      test 2  term 3     80
28   4      test 2  term 3     78
29   5      test 2  term 3     63

## Part 2: Population Data